brew 'git'
brew 'npm'

cask '1password/tap/1password-cli'

cask 'firefox'
cask 'google-chrome'

cask 'vlc'
cask 'macdown'

brew 'neovim'
brew 'mutt'

cask 'xquartz'
cask 'docker'

brew 'the_silver_searcher'
brew 'jsonnet'

brew 'cairo'
brew 'curl'
brew 'wget'
brew 'tmux'
brew 'p7zip'
brew 'awscli'

brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'

brew 'gpatch'
brew 'less'
brew 'm4'
brew 'make'
brew 'nano'

brew 'automake'

# GNU Privacy Guard (GnuPG) provides encryption as a free replacement for PGP.
brew 'gpg'

# OpenSSL is an open-source implementation of the SSL and TLS protocols.
brew 'openssl'

# Functions for use by applications that allow users to edit command lines while typing.
brew 'readline'

# Parallel SSH
brew 'pssh'

# pkg-config is a helper tool used when compiling applications and libraries.
brew 'pkg-config'

brew 'zstd'

# unzip is the classic command.
brew 'homebrew/dupes/unzip'

brew 'homebrew/dupes/rsync'

cask 'transmission'

brew 'ag'
brew 'netcat'
brew 'lynx'
brew 'graphviz'
brew 'gnuplot'
brew 'tree'
brew 'imagemagick'
brew 'flac'
brew 'ffmpeg'
brew 'exif'
brew 'exiftags'
brew 'exiftool'

brew 'libgphoto2'
brew 'libpng'
brew 'libtiff'

brew 'ctags'

brew 'htop'
brew 'ack'

brew 'postgresql'
brew 'redis'
brew 'sqlite'

brew 'pandoc'

brew 'libffi'
brew 'libiconv'
brew 'libmagic'
brew 'libtool'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'libzip'

brew 'libjpg'
brew 'libpng'
brew 'libtiff'

brew 'lsd'
brew 'ranger'
brew 'ncdu'
brew 'jq'
brew 'yq'

brew 'lazygit'
brew 'gitui'
brew 'gh'
brew 'git-lfs'

brew 'reattach-to-user-namespace'

brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'lua-language-server'
brew 'fzf'
brew 'zplug'
brew 'rg'
brew 'r'
brew 'bat'
